benchmarkingExperiments/data/hazard_vest_16t16c75rps.out
Running 5m test @ http://172.31.22.216:5000/hazard
  16 threads and 16 connections
  Thread calibration: mean lat.: 3538.410ms, rate sampling interval: 13737ms
  Thread calibration: mean lat.: 2857.376ms, rate sampling interval: 11403ms
  Thread calibration: mean lat.: 3393.728ms, rate sampling interval: 13590ms
  Thread calibration: mean lat.: 3246.050ms, rate sampling interval: 14073ms
  Thread calibration: mean lat.: 3100.266ms, rate sampling interval: 12369ms
  Thread calibration: mean lat.: 3242.730ms, rate sampling interval: 12697ms
  Thread calibration: mean lat.: 2458.971ms, rate sampling interval: 11067ms
  Thread calibration: mean lat.: 3081.373ms, rate sampling interval: 12148ms
  Thread calibration: mean lat.: 3183.040ms, rate sampling interval: 12836ms
  Thread calibration: mean lat.: 2778.002ms, rate sampling interval: 11722ms
  Thread calibration: mean lat.: 3163.864ms, rate sampling interval: 13049ms
  Thread calibration: mean lat.: 2702.956ms, rate sampling interval: 11296ms
  Thread calibration: mean lat.: 3211.323ms, rate sampling interval: 12066ms
  Thread calibration: mean lat.: 3070.528ms, rate sampling interval: 11862ms
  Thread calibration: mean lat.: 3661.205ms, rate sampling interval: 13811ms
  Thread calibration: mean lat.: 3609.962ms, rate sampling interval: 14041ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.74m     0.94m    3.44m    58.67%
    Req/Sec     1.00      0.14     2.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.75m 
 75.000%    2.53m 
 90.000%    3.04m 
 99.000%    3.36m 
 99.900%    3.41m 
 99.990%    3.44m 
 99.999%    3.45m 
100.000%    3.45m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    7081.983     0.000000            1         1.00
   25001.983     0.100000          708         1.11
   44236.799     0.200000         1416         1.25
   66060.287     0.300000         2124         1.43
   87490.559     0.400000         2832         1.67
  104923.135     0.500000         3541         2.00
  116195.327     0.550000         3894         2.22
  124256.255     0.600000         4248         2.50
  132972.543     0.650000         4604         2.86
  143654.911     0.700000         4959         3.33
  152043.519     0.750000         5317         4.00
  156106.751     0.775000         5496         4.44
  160169.983     0.800000         5670         5.00
  166854.655     0.825000         5841         5.71
  173539.327     0.850000         6020         6.67
  177864.703     0.875000         6196         8.00
  180223.999     0.887500         6284         8.89
  182321.151     0.900000         6372        10.00
  184549.375     0.912500         6461        11.43
  186908.671     0.925000         6553        13.33
  189530.111     0.937500         6639        16.00
  191102.975     0.943750         6682        17.78
  192937.983     0.950000         6726        20.00
  194904.063     0.956250         6770        22.86
  196607.999     0.962500         6819        26.67
  197656.575     0.968750         6859        32.00
  198311.935     0.971875         6882        35.56
  198836.223     0.975000         6905        40.00
  199360.511     0.978125         6931        45.71
  199884.799     0.981250         6950        53.33
  200409.087     0.984375         6969        64.00
  200671.231     0.985938         6981        71.11
  201064.447     0.987500         6993        80.00
  201457.663     0.989062         7004        91.43
  201850.879     0.990625         7015       106.67
  202113.023     0.992188         7025       128.00
  202375.167     0.992969         7031       142.22
  202637.311     0.993750         7038       160.00
  202768.383     0.994531         7041       182.86
  203030.527     0.995313         7047       213.33
  203423.743     0.996094         7054       256.00
  203554.815     0.996484         7056       284.44
  203685.887     0.996875         7059       320.00
  203816.959     0.997266         7061       365.71
  203948.031     0.997656         7063       426.67
  204210.175     0.998047         7067       512.00
  204210.175     0.998242         7067       568.89
  204341.247     0.998437         7069       640.00
  204472.319     0.998633         7070       731.43
  204603.391     0.998828         7073       853.33
  204603.391     0.999023         7073      1024.00
  204603.391     0.999121         7073      1137.78
  204865.535     0.999219         7074      1280.00
  204996.607     0.999316         7075      1462.86
  204996.607     0.999414         7075      1706.67
  205389.823     0.999512         7076      2048.00
  205389.823     0.999561         7076      2275.56
  205914.111     0.999609         7077      2560.00
  205914.111     0.999658         7077      2925.71
  205914.111     0.999707         7077      3413.33
  206307.327     0.999756         7078      4096.00
  206307.327     0.999780         7078      4551.11
  206307.327     0.999805         7078      5120.00
  206307.327     0.999829         7078      5851.43
  206307.327     0.999854         7078      6826.67
  206700.543     0.999878         7079      8192.00
  206700.543     1.000000         7079          inf
#[Mean    =   104243.285, StdDeviation   =    56600.301]
#[Max     =   206569.472, Total count    =         7079]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7284 requests in 5.00m, 1.30MB read
  Socket errors: connect 0, read 0, write 0, timeout 11
Requests/sec:     24.27
Transfer/sec:      4.43KB